Tekla.Structures.Analysis.AnalysisDesignParameterBase
The AnalysisDesignParameterBase class contains base information related to analysis design parameters.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.MaterialType
The material type of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.isGeneral
This indicates whether the design parameter is general.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.name
The name of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.unit
The unit of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.IsGeneral
Gets or sets a value indicating whether the design parameter is general.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.Name
Gets or sets the name of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.Unit
Gets or sets the unit of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterBase.Modify
Modifies an analysis design parameter at the database.
Inserts if parameter does not exist.